src/Catalogs/Изготовители.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Изготовители</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладскойБренд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСайта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыведенИзОбращения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Изготовители/Ext/ObjectModule.bsl
Перем мЗарегистрироватьИзмененияДляСайта;

Процедура ПриЗаписи(Отказ)
	Если мЗарегистрироватьИзмененияДляСайта тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, Метаданные.ПланыОбмена.ОбменПартКом83_Сайт);
	КонецЕсли;
	
	// + 20170522 Пушкин
	Справочники.Изготовители.ПроверкаИзготовителейПоНаименованию(ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.Ссылка,"Наименование"));
	// - 20170522 Пушкин
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ВыведенИзОбращения Тогда
		 Замена = Справочники.Изготовители.ПустаяСсылка();
	КонецЕсли;
	
	мЗарегистрироватьИзмененияДляСайта = ОбменДаннымиКлиентСервер.НеобходимаРегистрацияИзменений(Метаданные.ПланыОбмена.ОбменПартКом83_Сайт, ЭтотОбъект);
	ЗаполнитьЗначенияКонтроля();
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, Метаданные.ПланыОбмена.ОбменПартКом83_Сайт);
КонецПроцедуры

Процедура ЗаполнитьЗначенияКонтроля()
	
	лРеквизитыКонтроля = Справочники.Изготовители.ПолучитьРеквизитыКонтроля(Метаданные.ПланыОбмена.ОбменПартКом83_TopLog);
	лШапка = Неопределено;
	Результат = Новый Структура;
	Если лРеквизитыКонтроля.Свойство("Шапка", лШапка) тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, лШапка);
		Результат.Вставить("Шапка", ЗначенияРеквизитов);	
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("СтарыеЗначения", Результат);
	
КонецПроцедуры


// + 20170301 Пушкин
мЗарегистрироватьИзмененияДляСайта = Ложь;
// - 20170301 Пушкин
